파이썬

7/5 

실습환경 구축 
https://www.python.org/downloads/
    설치옵션
    - Add python.exe to path 선택
    
    C:\Users\admin> python --version
    Python 3.12.4
    
>>> import os
>>> os.system('cls')
>>> message
'안녕하세요'
>>>
>>> message="안녕하셍"
>>> message            
'안녕하셍'
>>>
    
    

자료형

1. 숫자형 
    1) 정수형 
    2) 실수형 
    3) 8진수와 16진수 


2. 숫자형 연산자 
    1) 사칙연산
    2) ** 연산자
    3) % 연산자
    4) // 연산자

3. 문자열 자료형
    1) 문자열을 만들고 사용하기
    2) 문자열 안에 작은 따옴표나 큰 따옴표를 포함시키고 싶을 때
    3) 여러 줄인 문자열을 변수에 대입하고 싶을 때
    4) 이스케이프 코드란

4. 문자열 연산하기
    1) 문자열 더해서 연결하기
    2) 문자열 곱하기
    3) 문자열 곱하기를 응용하기
    4) 문자열 길이 구하기


